{"data":{"markdownRemark":{"html":"<p>I read a blog post and now I'm inspired by <a href=\"https://ejohn.org/blog/write-code-every-day/\">John Resig</a> (Who was in turn, inspired by <a href=\"https://jenniferdewalt.com/\">Jennifer Dewalt</a>), I am going to write code every day, starting today. I hope to write about my coding progress regularly on this blog.</p>\n<h1>Why I intend on writing as I go along</h1>\n<ul>\n<li>\n<p>Obligate me to actually code every day (though this may not work because this blog has practically no readership)</p>\n</li>\n<li>\n<p>Keep a log of my progress over time</p>\n</li>\n<li>\n<p>Recall the reasoning I used when justifying decisions (e.g. this list describes why I decided to blog while doing this)</p>\n</li>\n</ul>\n<!-- more -->\n<h1>What I hope to gain from this</h1>\n<ul>\n<li>\n<p>Better programming skills and intuition. Improved familiarity with tools, paradigms, etc.</p>\n</li>\n<li>\n<p>Improve my algorithmic knowledge.</p>\n</li>\n<li>\n<p>Learn new languages, frameworks etc. by application rather than just reading docs.</p>\n</li>\n<li>\n<p>Create some interesting projects, hopefully, some worth mentioning in a <a href=\"https://eulercoder.me/2017/07/slack-internship-sf-silicon-valley/\">technical interview</a> or something (for those \"describe a time you ran into a problem when programming and how you fixed your problem\" type questions)</p>\n</li>\n<li>\n<p>Spend free time more productively (as of now, coding seems like a much more useful way of spending my free time than chatting on WhatsApp or watching prank videos on YouTube)</p>\n</li>\n<li>\n<p>Meet people, become more familiar with the many programming communities on the internet.</p>\n</li>\n</ul>\n<h1>Ideas what to do each day</h1>\n<p>This section is more of just a brainstorm/dump of different ways I can code each day.</p>\n<ul>\n<li>\n<p>Learn a new language or framework. On my to-learn list: Dart, Go, R and other JavaScript web frameworks.</p>\n</li>\n<li>\n<p>Solve problems on different Coding platforms and Interview problems.</p>\n</li>\n<li>\n<p>Play with APIs and write tools for myself and the community.</p>\n</li>\n<li>\n<p>Contribute to Open Source projects.</p>\n</li>\n</ul>\n<h1>What are the projects currently I'm working on</h1>\n<ul>\n<li>\n<p><a href=\"https://github.com/vicky002/Charmander\">Charmandar</a>: A New Bot for Slack, I'm trying to bring Google right there in your Slack channel. I'm working on it since a month and it is still under development.</p>\n</li>\n<li>\n<p><a href=\"https://github.com/vicky002/Milotic\">Milotic Theme</a>: Milotic is a new theme for all text editors available. The theme for sublime and Visual Studio is available and under development for other text Editors.</p>\n</li>\n<li>\n<p><a href=\"https://github.com/vicky002/FCC-DL\">FCC-Downloder</a>: FCC-Downloader is script to download all your solutions on <a href=\"https://freecodecamp.com\">FreeCodeCamp</a>.</p>\n</li>\n<li>\n<p><a href=\"https://freecodecamp.com\">FreeCodeCamp</a>: Next Week I'll be analyzing data of FCC. You can join the <a href=\"\">gitter channel</a> for more information about the project.</p>\n</li>\n</ul>\n<p>That's all!</p>","frontmatter":{"title":"Code Every Day: Eulercoder Motivation","categories":["code-motivation"],"date":"23 July, 2017","author":{"fields":{"slug":"/contributors/vicky002"},"id":"vicky002"}}}},"pageContext":{"slug":"/2017/07/code-everyday","next":{"frontmatter":{"title":"Getting Started with Open Source","author":{"id":"vicky002"}},"fields":{"slug":"/2017/07/getting-started-with-open-source"}},"prev":{"frontmatter":{"title":"HTTP Headers Related to Security","author":{"id":"vicky002"}},"fields":{"slug":"/2017/07/http-headers"}}}}