{"data":{"markdownRemark":{"html":"<p>Education Minister of India announced today that every engineering student has to undergo minimum three internships. I am glad that Education minister is thinking about the unemployment. As per the reports, 80% of engineering graduates in India are \"unemployable\". This definitely tells that our Education system needs to be revamped and training system of the teacher and students needs to be upgraded. Internships definitely help a lot in becoming a better engineer. It gives you exposure to the real world things, one good internship can be easily compared with four years of Engineering. Regarding today's announcement about three internships, the very first thought that came into my mind was, this is going to be very tough for engineering colleges to provide internships to students. Let's analyze it in this article.</p>\n<h2>Total Engineering colleges in India:</h2>\n<!-- more -->\n<p>As per the report, there are more than 6500+ engineering colleges in India. The total number of engineering seats in India is around 15,00,000+. So, there are 6500 colleges and if we take an average of total students in any engineering college, considering one college is offering four branches and one branch has up to 60 students. If we do the match, 6500 _ 4 _ 60 = 15,60,000 students. This means around 15 Lacs students take admission in engineering colleges every year.</p>\n<h3>15 Lac students will be looking for internships</h3>\n<p>Now, in the first year of engineering, rarely any student does an internship. They just start the four-year degree course without any prior knowledge of programming.</p>\n<p><strong>Extra Read:</strong> <a href=\"https://eulercoder.me/2017/07/what-is-the-ideal-time-to-apply-for-internships-and-jobs/\">What is the ideal time to apply for an internship?</a></p>\n<p>In the second year, we learn about C, Java, Data Structures, Algorithms and about Web development. The education minister said it will be college's responsibility to provide internships to students. So, now every student and college faculty also will ask students to start looking for internships after the second year. Consider there are at least 240 students in an engineering college, out of them 40 secured internships on their own. For a college helping 200 students internship in different companies and startups is going to be a tough task. Competition for getting an internship will increase as everyone will be worried about the internship, career, and job.</p>\n<h3>Rise of training companies</h3>\n<p>You must be knowing about the training companies, they provide training to new employees, take interns, give them big projects for a particular duration, pay a lower stipend (sometimes it's unpaid internship) and assign them mentors who are mentors just for the name of it. Friends, this happens a lot, there are hundreds of training companies which are doing this only. In India, people always find a way to fool the system. These training companies will increase and maybe to maintain college's reputation and show government best results, colleges may contact these companies and ask them to visit colleges.</p>\n<p>I am not saying this is very bad. It is good, rather than sitting at home you will be doing something to improve your own skills. I am talking from the business point of view.</p>\n<h3>If I have just two internships in my resume, will this affect me?</h3>\n<p>No, I don't think so. For a company, your skills and how you perform in the interview is all that matters the most. Yes, having two or more internships and good projects will definitely help you a lot to get shortlisted. You will have higher chances of getting an interview than those with one internship only. Again, there are so many factors, it will depend on the company you interned, your role there, how solid if your personal projects etc. I am not going into too many details. You can read my <a href=\"https://eulercoder.me/2017/07/summer-internship-ultimate-guide/\">summer internship guide here which is recommended by over 1000+ students</a> on the web and it is one of the top guide available currently.</p>\n<h3>To the students who will be starting their Engineering Course</h3>\n<p>If you are going to start your engineering course very soon starting next month. I'd say do not worry about this right now. This is not going to be implemented very soon, so don't panic. You are just starting your engineering, enjoy the beginning, do networking, take part in events and **learn to program. **Work on your programming skills in your second year, solve problems on Hackerrank or CodeChef. Try open source development. Try everything and find your love for something and do it well.</p>\n<p><strong>Read:</strong> <a href=\"https://eulercoder.me/2017/07/competitive-programming-open-source/\">Competitive Programming or Open Source: Which one to choose?</a></p>\n<p><strong>Try for internships after:</strong></p>\n<ul>\n<li>\n<p>Competiton of your 2nd year (Summer Internship)</p>\n</li>\n<li>\n<p>Winter internship for 5-6 weeks after 5th semester (Mid of 3rd year)</p>\n</li>\n<li>\n<p>Summer Internship at the end of your internship.</p>\n</li>\n</ul>\n<p>You will have to plan and work accordingly.</p>\n<h3><strong>Conclusion</strong></h3>\n<p>This is going to be tough for colleges and students as well to get three internships. Governments SWAYAM portal, which is just launched for free online courses, is also not that good. It is a platform for teachers to sign up for courses and learn there about new technologies. College and students will keep struggling about it and there will be these training companies which will benefit from it.</p>\n<p>What do you think about the announcement? If you agree with me and just say yes or comment down below and we will have an open discussion about it.</p>\n<p>Thank you!</p>\n<p>** My Story **</p>\n<ul>\n<li>\n<p><a href=\"https://eulercoder.me/2017/07/slack-amazon-mozilla-linkedin-interview/\">Slack, Amazon, LinkedIn, Browserstack, Mozilla - My Internship Interview Experience</a></p>\n</li>\n<li>\n<p><a href=\"https://eulercoder.me/2017/07/slack-internship-sf-silicon-valley/\">Summer Internship, San Francisco, and Silicon Valley</a></p>\n<!-- more -->\n</li>\n</ul>\n<hr>\n<p>Eulercoder is a platform for everything related to computer science. We weekly send emails with our top articles directly in the mailbox. Subscribe to Eulercoder to get latest updates in engineering and computer science. Lastly, we have a closed <a href=\"https://www.facebook.com/groups/eulercoder\">group on Facebook</a>, join in to discuss issues, queries, tutorials, anything related to CS.</p>","frontmatter":{"title":"Three Internships mandatory for Engineering Students- Analysis and Discussion","categories":["discussion","internship"],"date":"27 July, 2017","author":{"fields":{"slug":"/contributors/vicky002"},"id":"vicky002"}}}},"pageContext":{"slug":"/2017/07/three-internship-mandatory","next":{"frontmatter":{"title":"Basic skills needed prior to applying for internships","author":{"id":"vicky002"}},"fields":{"slug":"/2017/07/skills-needed-for-internship"}},"prev":{"frontmatter":{"title":"Slack, Amazon, Mozilla, Browserstack- My Internship Interview Experience","author":{"id":"vicky002"}},"fields":{"slug":"/2017/07/internship-interview-experience"}}}}