{"data":{"markdownRemark":{"html":"<p>It's been a long time. I'm writing a blog post after almost 3 months, apologies for being away from you all for so long. I was extremely busy during my whole internship, weekdays at work and weekends mostly spent in exploring places, meeting new people and attending events. This post is all about my Slack internship experience and how it feels like to be in San Francisco and Silicon Valley.</p>\n<p>After talking to my friends in many big companies, I can say that Slack Internship program is possibly one of the best internship programs. Three years in college can be compared to 10 weeks of my Slack internship. Honestly, Now I feel like a developer, a real software engineer who can create something. People at Slack are very passionate, they love the product so much and value our mission of making working life simpler, more pleasant and more productive. It doesn't feel like you are working here or it's a daily job that you need to do. You can reach out to anyone for help. I worked with our CTO very closely and our CEO used to sit one row behind my desk and guess what? He added me on snapchat :p</p>\n<p>First whole week was only orientation and onboarding process and having a great onboarding process is extremely important. At the end of my first week, I was knowing how Slack works from the bottom to top and started working from my second week. I worked mostly on Testing and Test infrastructure. Now I want to focus more on web/Test Infrastructure and operations.</p>\n<p>If you are in the third year and preparing for a summer internship, prepare well and apply to companies wisely. It's extremely important to decide what you actually want to work on and your role before you apply for the internship.</p>\n<!-- more -->\n<p><strong><em>Choose a company wisely:</em></strong></p>\n<p>Many people get an internship in companies having very high pay but what they actually do there is; replying to customer emails and feeding excel sheets. It's better to work in a small tech startup with low stipend than working in big banks. Do what is good for your career.</p>\n<p><em><strong>Why role is extremely important:</strong></em></p>\n<p>You will see many 'Software Engineer Internship' posts on career websites and they don't mention what you are going to do there. So, it's better to tell them in your first round or apply to specific internship roles. Hopefully, you won't struggle in your internship fixing a div element being a Backend developer.</p>\n<p>**Check: **Internship and Software Engineering Job: The Ultimate Guide [x<em>button shape=\"square\" size=\"small\" float=\"none\" href=\"https://eulercoder.me/blog/internship-software-job-ultimate-guide/\" title=\"Internship and Software Job: The Ultimate Guide\" target=\"blank\" info=\"none\" info</em>place=\"top\" info_trigger=\"hover\"]Full Course[/x_button]</p>\n<hr>\n<p>San Francisco, A crimson bridge, cable cars, a sparkling bay, and streets lined with elegant Victorian homes—San Francisco is undeniably one of the world’s great cities. San Francisco has everything you can dream of! <a href=\"https://www.flickr.com/search/?text=san%20francisco\">San Francisco</a> is known for its cool summers <a href=\"https://www.currentresults.com/Weather-Extremes/US/coldest-cities-summer.php\">the coolest summer in the US</a>], fog, steep rolling hills, eclectic mix of architecture, and landmarks including the Golden Gate Bridge, cable cars, the former prison on Alcatraz Island, and its Chinatown district.</p>\n<p>I'd love to spend all my time in San Francisco but everything is very expensive. There are so many homeless people and it's advised to not to walk alone after 9-10 PM but I did go out in the night at 3 AM many times just to experience everything and see what actually happens in the SOMA and Tenderloin Neighborhood. You can see people buying and selling drugs, taking Marijuana on the streets even during day time. If you are moving there alone then you can definitely live in the city but with family, No! I can't even think of living in the city with my family. I can live somewhere near SF maybe in Berkeley or Sunnyvale.</p>\n<p>If you are going there for an internship, you should definitely live in the city. There are so many places to explore, amazing restaurants and clubs almost after every two blocks.</p>\n<hr>\n<p>Silicon Valley, yes it is! Whether you are sitting in a restaurant or in a club or you are walking on the street, you will hear people talking about start ups, funding and everything about tech. When you are surrounded by geeks it's very easy to initiate a conversation, make friends and create a network. During summer most of the companies organize many open house and intern events to attract talents but it's a very good opportunity to meet new people and make friends. Now I have so many friends there and also I know someone in almost all the big companies and good startups.</p>\n<p>If you are going there for a summer internship, there are many groups on Facebook and Slack for 'bay area interns' join them if you want to make the most of your internship.</p>\n<p>That's all!</p>\n<p>You can check All San Francisco Photos on <a href=\"https://instagram.com/_banjara_\">Instagram : @<em>banjara</em></a></p>","frontmatter":{"title":"Slack Internship Experience- San Francisco and Silicon Valley","categories":["internship"],"date":"22 July, 2017","author":{"fields":{"slug":"/contributors/vicky002"},"id":"vicky002"}}}},"pageContext":{"slug":"/2017/07/slack-internship-experience","next":{"frontmatter":{"title":"Slack Bot using Wolframalpha API - Basic Guide","author":{"id":"vicky002"}},"fields":{"slug":"/2017/07/slack-bot"}},"prev":{"frontmatter":{"title":"What Is The Ideal Time To Apply For Internships And Jobs","author":{"id":"vicky002"}},"fields":{"slug":"/2017/04/internship-post"}}}}