{"data":{"markdownRemark":{"html":"<p>Eulercoder.me is a platform for students by the students to discuss and read all things about Computer Science, Open Source, Internships, Jobs and freelancing. Since the last 8 months, we haven’t updated our website, there wasn’t a single new blog post that was written and we are very sorry about it. We have received tremendous love from students for our articles. There are over 5000+ subscribers and our posts are read by almost 500 new users every day. The reason for the website not being active since so long — I was the single person working on it, I got super busy after my graduation from college and couldn’t get time to write posts. Good news is that now we have a team of students and developers willing to work on the platform and we are bringing lots of new features and upgrading our site design as well. 🚀🎉</p>\n<h2>We Are Going Open Source 🚀</h2>\n<p>I love Open Source. Every product and project use tens and hundreds of open source libraries, it is nearly impossible to build something which is independent of any open source packages. I’m very grateful and thankful to the community of developers and the Github platform.</p>\n<p>The good news — now everything that we will do — Projects, articles, websites, everything will be Open Source and will be available on Github for reuse, edit and improve. I know the power of the Open Source community and developers, and with your help, we can achieve a lot together.</p>\n<h2>All New Projects Page 📃</h2>\n<p>We know college students and developers work on a lot of projects and it’s always a struggle to showcase and promote work on the web. Eulercoder now has a projects page, where you can showcase your projects, just write the description, URLs and few screenshots or images. It will be live on our website in a few minutes. And, the best part — We will help you market and promote your work on our partner websites, social media channels, and email newsletter. This will definitely give much more visibility to the projects.</p>\n<h2>Curated Internships and Undergrad Jobs 🎓 💼</h2>\n<p>We know how hard it is to keep up with the open internship roles, deadlines and the preparation. Well, Eulercoder now has a page with curated jobs, internships available in companies and we are working hard to add interview preparations tips and questions so that you have all things in one place.</p>\n<p>Companies can also add their jobs on our page just by simply editing the file on Github. Though we would like to have some fee from companies to support and maintain our website and the team. We haven’t decided the fee yet but it will come on our website when we need some $$ 😉. For now, there is no fee to add jobs to our platform.</p>\n<h2>Plans Ahead:</h2>\n<p>With a couple of major updates, we have more plans ahead in the upcoming months, we need your help in achieving these goals.</p>\n<ul>\n<li>Public 4 blog posts on different topics of Computer Science every week, it can be articles, tutorials, guides, and tips.</li>\n<li>Create different courses of frameworks and tools like — NodeJS, React, Gatsby, JavaScript, Go, TypeScript, Docker etc</li>\n<li>Create a forum using Discourse [ discuss.eulercoder.me ] where students and developer can talk about interviews, jobs, projects, issues and post questions about anything tech.</li>\n<li>Train and prepare candidates for the interview using mock interviews, on-call tips, premium training materials etc.</li>\n<li>Make our website dynamic by adding Sign In, Sign up and profile pages, have badges for top contributing users.\nAnd many more!</li>\n</ul>\n<p>We have bigger plans in 2019 and we are hoping 2019 to be the best year for Eulercoder and our community. Let’s work hard and make a one-stop platform for Computer Science, Open Source and everything tech.</p>\n<p>If you would like to work with us in on writing technical posts, making course videos, work on our website or do projects us, please fill this form and a member of our team will reach out to you to discuss the opportunity.</p>\n<p>Wishing you a very happy and a great year ahead! 💥🚀</p>\n<p>Thank you! 🙇</p>","frontmatter":{"title":"We are launching all new Eulercoder website","categories":["announcement","platform"],"date":"02 January, 2019","author":{"fields":{"slug":"/contributors/vicky002"},"id":"vicky002"}}}},"pageContext":{"slug":"/2019/01/all-new-eulercoder-website","next":null,"prev":{"frontmatter":{"title":"Eulercoder Project Series Fabulous Bot First Project Announcement","author":{"id":"vicky002"}},"fields":{"slug":"/2017/09/eulercoder-project-series-fabulous-bot"}}}}