{"data":{"markdownRemark":{"html":"<h1></h1>\n<p>[caption id=\"\" align=\"alignnone\" width=\"1024\"]<img src=\"https://cdn-images-1.medium.com/max/1600/1*6Z_FxH-h8rcfDdGb9-gn1w.jpeg\" alt=\"Kevin Hsu teaching students - eulecoder\"> Kevin taking a workshop[/caption]</p>\n<h1>First thing first. Self-learning and Why did I even start coding?</h1>\n<p>My first try with coding was with <a href=\"https://www.youtube.com/user/sdwuntnu\">Dr Wu</a> at National Taiwan Normal University. I was a high school student at the time and Dr Wu was my mentor. During the weekends, he would lead me and another friend to learn coding with assignments like developing a <a href=\"https://en.wikipedia.org/wiki/Big_two\">Big Two game</a> with C++. And that was without any GUI, you would have to play my game with C++ consoles…</p>\n<p>And it was certainly fun. The sense of achievement when my program compiles and runs properly was thrilling.</p>\n<p>I really liked it, but when the time came to choose a major to pursue in my University career, I was more gravitated towards Business subjects — They somehow seemed cooler to me.</p>\n<p>I think I will skip the part where I had my miserable experiences studying Business and doing my first internships (If you are actually interested in knowing this suffering part, do check out my post on LinkedIn — <a href=\"https://www.linkedin.com/pulse/from-businessstartup-kid-software-engineer-intern-microsoft-hsu\">From a Business/Startup Kid to a Software Engineer Intern at Microsoft</a>), but anyway, that was how I started to reconsider my career choices and decided to give coding a second chance.</p>\n<p>**Read: **<a href=\"https://eulercoder.me/2017/07/summer-internship-ultimate-guide/\">Summer Internship: The Ultimate Guide Recommended by 1000+ students</a></p>\n<h2>Have a Clear Goal</h2>\n<p>In addition to studying Business is really just not my thing, another dominant reason for me to start coding was that I wanted to develop a platform for students to meet other student talents from different backgrounds. I have always been a startup enthusiast. So the ability to develop and deliver a website or app to users was really in demand from myself.</p>\n<p>I later think this is also one of the crucial reasons I made it through — I had a straight and clear goal and rationale behind these learning activities.</p>\n<p>This is definitely something I would recommend beginners to think about. Try to come up with a goal, the reason why you are thinking about self-learning to code, or even reading this article. That would help you a lot on the way through. In my case, I was <strong>motivated</strong> to dive into web programming.</p>\n<p>But you might ask this. How would you know what the <em>right</em> languages or knowledge to start with are?</p>\n<p>My answer is that you really have to <strong>do your own research</strong>. Take me for example, I learned that web development can be broke down into frontend and backend components and that frontend typically consists of HTML, CSS while backend can be JavaScript, Python or even Java, C#. And all these research is also a crucial part of my self-learning process. On the other hand, or hands, if you are more into the hot topics like AI, Machine Learning or VR, there are yet other toys to play with.</p>\n<!-- more -->\n<h2>Learning with Online Resources</h2>\n<p>Once you have your own goal, it’s the exciting fun time to mine useful resources online. There are really just a number of great tutorials available on the Internet. A lot of them are even free. Let me try to list down the ones I used and would recommend.</p>\n<ul>\n<li><a href=\"https://www.freecodecamp.org/\">FreeCodeCamp</a> is a great example of <strong>online resources that are free</strong> when it comes to getting started with learning web programming. It provides detailed step-by-step instructions to create and style website elements (which is called DOM) as well as using JavaScript to interact with them. They did a great job gamify the learning process and community building. You can pretty much find a FreeCodeCamp meetup group in every city (<a href=\"https://www.facebook.com/groups/free.code.camp.taipei/\">FCC TP</a>, for example). I would definitely recommend this to fresh starters to finish until at least the section of JSON APIs and AJAX. These are really important foundations to any complex projects.</li>\n</ul>\n<p>[caption id=\"\" align=\"alignnone\" width=\"1600\"]<img src=\"https://cdn-images-1.medium.com/max/1600/0*5X-j0zr9ZV4Qgt4c.png\" alt=\"image - self-learning on Freecodecamp website\"> Freecodecamp course[/caption]</p>\n<ul>\n<li>Scott from <a href=\"https://leveluptutorials.com/\">Levelup Tutorials</a> is someone I secretly feel like I can’t thank enough to. Once I finish most of the FreeCodeCamp content, I went on to find some video tutorials with real-life examples. I mean, I agree with how some people say technology stacks grow fast nowadays, you don’t have to re-invent the wheel when there are tools and frameworks available to help you build efficient server and UI. After building up solid foundations from FreeCodeCamp, the <a href=\"https://www.leveluptutorials.com/tutorials/meteor-1-4-for-everyone\">Meteor For Everyone</a> and <a href=\"https://www.leveluptutorials.com/tutorials/meteor-react-for-everyone\">Meteor &#x26; React For Everyone</a> series from Levelup Tutorials (both free of charge) really prepared me to apply HTML, CSS, JavaScript knowledge onto modern frameworks like Meteor and React using real-world web development examples.</li>\n</ul>\n<p>[caption id=\"\" align=\"alignnone\" width=\"1600\"]<img src=\"https://cdn-images-1.medium.com/max/1600/0*DhmwZYDF_IbEQIK5.png\" alt=\"Image - Self-learning on LevelTuts by eulercoder\"> LevelTuts[/caption]</p>\n<ul>\n<li><a href=\"https://www.udemy.com/\">Udemy</a> is another platform that I would definitely recommend you to check out. Both FCC and LevelupTuts lean towards introducing web technologies. On the other hand, Udemy is a platform where teachers from all over the world upload paid or free tutorials with contents ranged from web development to native apps and even chatbots. Now, because a lot of them are paid, I won’t do specific recommendations on purchasing which ones of them here, but Udemy did do an <a href=\"https://about.udemy.com/students/student-profile-kevin-hsu/\">interview with me</a> (see how active I was using this platform haha). You can always check out the post for some more information.</li>\n</ul>\n<p>[caption id=\"\" align=\"alignnone\" width=\"1600\"]<img src=\"https://cdn-images-1.medium.com/max/1600/0*KhRymPHcW44IoIky.png\" alt=\"Self-learning on Udemy website image - eulercoder\"> Udemy Website[/caption]</p>\n<h2>Build Your Own Projects</h2>\n<p>After finishing a couple Meteor tutorials with Levelup Tutorials, I really felt empowered and had that desire and confidence to develop projects myself. At the time, I also just bumped into Dr Ray when I interned at Cocoon, a coworking space, who runs <a href=\"https://appslab.hk/\">CityU Apps Lab</a>. So I randomly just asked Dr Ray if I can join his lab although I don’t even study at City University.</p>\n<p>He said yes. <strong>Why not</strong>.</p>\n<p>We were both excited really. I was the first guy to actually join his lab as a trainee I think. But yeah, this is also something I learn along the way — the Can Do Spirit. If I hadn’t interned at a coworking space, I wouldn’t have met Dr Ray. And if I hadn’t overcome the shyness and demanded challenges for myself, I wouldn’t have come to develop a file streaming web app with the lab — with which experience, I got my first internship as a developer at a wonderful startup called <a href=\"https://www.25sprout.com/\">25Sprout</a> in Taiwan.</p>\n<p>Everything above, from getting started to getting my first internship, happened in exactly one year since I started to learn to code.</p>\n<p>The point is: try to always look for opportunities building projects with the technologies you like. They are your resume and therefore valuable tickets to your next bigger and more exciting opportunities.</p>\n<p>But, you may think, what if there is just no opportunity.</p>\n<p>Then <strong>make one</strong>. Build your own personal website for example. This is also something I think every developer should do. I also made <a href=\"https://kevinhsu.info/\">mine</a> (which I am currently revamping) when I finished FreeCodeCamp with Bootstrap. Getting one up and running isn’t just a fine exercise, you will also get to try to ship a website by buying and configuring your first domain and hosting server.</p>\n<h2>Keep Learning</h2>\n<p>Now it’s been another year since I joined 25Sprout as a summer intern. In this year, I do feel like my learning curve has not been as thrilling as it was before, but there are different exciting exposures as I started to lead and develop my dream projects with friends, had my first experience being a speaker in a <a href=\"https://www.youtube.com/watch?v=auNTp1lc2ZE\">student tech conference</a> introducing React and Meteor. I can, in fact, keep this list on and on. I met my partner to co-host a <a href=\"https://ecjamming.tech/\">Hackathon</a> that is nominated as one of the <a href=\"https://medium.com/@dottechdomains/10-mind-blowing-student-hackathons-from-around-the-world-833c139f8026\">Ten Mind-blowing Student Hackathons</a> [Medium Blog Link] from around the world, and finally now working as an intern at Microsoft, a tech giant company I am personally a fan of.</p>\n<p>I too had my setbacks along the way, which I mentioned in my <a href=\"https://www.linkedin.com/pulse/from-businessstartup-kid-software-engineer-intern-microsoft-hsu\">blog post</a> on Medium, but all of them have nurtured me to become more ready for my next success (if it does exist, of course, you never know).</p>\n<p>If I had to say there’s one thing I’ve learned from the 2 years of self-learning, that is more important than the coding skills, it has to be the ability to be proactive and always looking for next opportunities in the current ones. This is what truly drove and supported me to make every single challenging yet rewarding decisions including even to start learning something that is once completely alien to me — coding.</p>\n<hr>\n<p>That's it!</p>\n<p>This article was written by Kevin Hsu, read all his articles and <a href=\"https://medium.com/@kevin.wcb\">follow Kevin on Medium</a> also, connect with Kevin on <a href=\"https://www.linkedin.com/in/kai-chun-kevin-hsu-5428bbb4/\">LinkedIn</a>.</p>\n<p>**Have something to talk about? Want to contribute in our <a href=\"https://eulercoder.me/about\">Mission and Goal</a>? Write on Eulercoder. Write an <a href=\"mailto:hello@eulercoder.com\">email to us</a> or <a href=\"https://eulercoder.me/contact\">contact us</a> for guest posts. **</p>\n<p>Did you found this article useful? Write in comments, your thoughts on Kevin's journey and wish him luck. :)</p>\n<p>If you found this article motivating, do share with your friends. Let’s help everyone in getting a better internship, job and help them in learning programming. Subscribe to our newsletter and get weekly curated content directly in your mail box. Also, we have our own group on FB, we take Q&#x26;A, post materials in the group. I’ll highly recommend you to <a href=\"https://www.facebook.com/groups/eulercoder\">join our FB Group.</a></p>\n<p><strong>Other Recommended articles:</strong></p>\n<ul>\n<li>\n<p><a href=\"https://eulercoder.me/2017/07/slack-amazon-mozilla-linkedin-interview/\">Slack, Amazon, Mozilla, Browserstack, LinkedIn: My Internship Interview Experience</a></p>\n</li>\n<li>\n<p><a href=\"https://eulercoder.me/2017/07/basic-skills-needed-internship/\">Basic skills needed prior to applying for internships </a></p>\n</li>\n</ul>","frontmatter":{"title":"2 Years of Self-Learning Into a Developer- Eulercoder Motivation","categories":null,"date":"06 August, 2017","author":{"fields":{"slug":"/contributors/kevin"},"id":"Kevin"}}}},"pageContext":{"slug":"/2017/08/self-learning","next":{"frontmatter":{"title":"College and low GPA- Everything you need to know.","author":{"id":"vicky002"}},"fields":{"slug":"/2017/08/college-and-low-gpa"}},"prev":{"frontmatter":{"title":"Twitter Internship and Undergrad Role 2018- Everything you need to know","author":{"id":"vicky002"}},"fields":{"slug":"/2017/08/twitter-internship"}}}}