{"data":{"markdownRemark":{"html":"<h1>Let’s Build a React Chatroom Component</h1>\n<blockquote>Oh hey, how’s it going!</blockquote>\n<p>So — I was building this React Chatroom Component for my side-project, which I don’t think I will be able to launch soon due to <strong>a lot of things</strong>, I would love to chat about. But yeah, instead of letting this sit it my Gitlab for months, I thought open sourcing it to <a href=\"https://github.com/WigoHunter/react-chatapp\">Github</a> might just be a better idea.</p>\n<p>Who knows. I might even receive early feedbacks!</p>\n<p>And I love writing. So I will try to explain how I built this React Chatroom Component in 100 lines of JavaScript along with some high-level introductions of how React applications and components work!React applications and components work!</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/1*kjOH0q5D2vKlHq7Z5QrATQ.png\" alt=\"react chatroom - eulercoder\"></p>\n<!-- more -->\n<h3>Why React</h3>\n<p>I guess you might have your reasons if you decided to click into this post. You might find it cool. You might be hearing a lot of the library and just want to know more about it.</p>\n<p>For me, though, React is fun. It really disrupts the minimal unit level in web applications to become functional <strong>components</strong>, where you would define how a component is being rendered, along with the data it consumes and the functionalities it controls.</p>\n<p>This largely increases the re-usability of codes.</p>\n<p>For instance, I can very much write</p>\n<pre><code>&#x3C;code class=\"language-javascript\">class Chatroom extends React.Component {\nsubmitMessage() {\n// JS Code here\n}&#x3C;/code>\n\n\n\n\n&#x3C;code class=\"language-javascript\">render() {\nconst { chatHistory } = this.props;&#x3C;/code>\n\n\n\n\n&#x3C;code class=\"language-javascript\">return (\n{/* HTML code here */}\n);\n}\n}&#x3C;/code>\n</code></pre>\n<p>and from there, I would be able to render a Chatroom anywhere with</p>\n<pre><code>&#x3C;code class=\"language-javascript\">&#x3C;Chatroom chatHistory={chatHistory} />&#x3C;/code>\n</code></pre>\n<p>You see how data is being streamed in this case. You can simply inject the chat data from your App to a Chatroom component, which you would use just like HTML tags, and in the Chatroom component’s code, you will gain access to the data source with this.props.</p>\n<p>Beautiful isn’t it.</p>\n<p>And the missing HTML code and JS code are what will be covered in this tutorial.</p>\n<p>You can check out my source code on <a href=\"https://github.com/WigoHunter/react-chatapp\">my Github repo</a> where I also have a <a href=\"https://react-chatapp.surge.sh/\">demo</a> hosted on <a href=\"https://surge.sh\">Surge</a> (Definitely recommend Surge for its amazing and free single command line deployment)</p>\n<blockquote>Final Disclaimer: I will not include how I stream data with Meteor in this tutorial. That would make this too long to write for me, and of course, for you to read. If I do get the time, I will make another blog post about the createContainer functions that come with Meteor.</blockquote>\n<h3>Create-React-App</h3>\n<p>Another great thing about React is the support of open source community. Since all you will ever make with React are components, people are open sourcing their components like this front-end React-Chatapp on Github or Npm as well.</p>\n<p>This pretty much realizes the dream of “<strong>Don’t reinvent the wheels.</strong>” It’s completely possible for you to develop a website or application without writing any of these components. Just look up from Github or any other frameworks and inject the right data into the right components and you are good to go.</p>\n<p>It might bring you troubles to config webpacks and those magics in the background at first — But Facebook even mitigates this by providing a CLI to get a React app up and running with a single command line.</p>\n<p>So first, if you don’t have this tool installed, let’s first go to your terminal or iTerm and run (assuming npm is installed)</p>\n<pre><code>&#x3C;code class=\"language-git\">npm install -g create-react-app\ncreate-react-app &#x3C;the project name you want>\ncd &#x3C;the project name>\nnpm start&#x3C;/code>\n</code></pre>\n<p>from here, you will see a generic starting page run on localhost:3000</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/1600/1*bwFxqbpXBb0u4JS8IRw9Zg.png\" alt=\"react initilization - eulercoder\"></p>\n<p>And if you open the project folder with VSCode (Yup, Microsoft pride.), you will see the App Component in /src like this.</p>\n<pre><code>&#x3C;code class=\"language-javascript\">class App extends Component {\nrender() {\nreturn (\n{/* SKIP: Generic HTML codes */}\n);\n}\n}&#x3C;/code>\n</code></pre>\n<p>You can try to edit anything here and you will notice the website at localhost:3000 hot reloads. That is, You don’t need to refresh the page, the project will observe the file changes and hot reload the page for you.</p>\n<h3>Build the Chatroom</h3>\n<p>SO — Let’s get straight to the point. Let’s modify the render function of this App to only render a background div where we apply an easy Flexbox layout to pin the Chatroom in the center of the page (You can simply copy my CSS code from <a href=\"https://react-chatapp.surge.sh/static/css/main.b5d0bdf9.css\">here</a>, as I won’t be covering CSS in this post), and of course, the Chatroom component itself.</p>\n<pre><code>&#x3C;code class=\"language-javascript\">return (\n&#x3C;div className=“App”>\n&#x3C;Chatroom />\n&#x3C;/div>\n);&#x3C;/code>\n</code></pre>\n<p>Notice this should break your project because it doesn’t yet recognize the Chatroom Component. So now let’s plan how we would want our Chatroom to look like.</p>\n<p>You might have other ideas, but to me: a chatroom has two most critical missions:</p>\n<ul>\n<li>\n<p>Render the chat history</p>\n</li>\n<li>\n<p>Allow user to submit a new message</p>\n</li>\n</ul>\n<p>And this is also why I felt like this Component I made for my side-project, could be an alternative example other than to-do apps — Because these two objectives pretty much map to Create and Read operations in CRUD. Of course, Update and Delete are something you could add to chatrooms as well, but I just didn’t plan to have these functions in the prototype level of ChillTime.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/1600/1*AZHXZeU1kHwjRRQLNKSRxQ.png\" alt=\"chatroom submit message image - eulercoder\">The central part of the chatroom that renders chat history</p>\n<h3>Render Data</h3>\n<p>In the source code <a href=\"https://github.com/WigoHunter/react-chatapp/blob/master/src/Chatroom.js\">here in src/Chatroom.js</a>, you will see that I have prepared a set, or more specifically, an array of mock data of chat history. And in React, if you want to iterate and render each element in an array, you should make use of the map function.</p>\n<p>One thing to note though, is that instead of using React states to store data, in the cases you do have a Backend for data streaming, whether it is with Meteor methods, GraphQL queries, or any other server technics you are familiar with, you should inject data to the Chatroom Component as properties like <em><Chatroom chatHistory={chatHistory} /></em>.</p>\n<p>For the comparisons of props and states in React, there are already tons of great documents out there. So if you are interested in it, I would recommend you to checkout <a href=\"https://facebook.github.io/react/docs/state-and-lifecycle.html\">this official doc</a>. But in short, I would use State to control the component’s UI status, for example, whether a user is typing or not, and Props for actual data of the application.</p>\n<pre><code>&#x3C;code class=\"language-javascript\">&#x3C;ul className=“chats” ref=“chats”>\n{\nchats.map((chat) =>\n&#x3C;Message chat={chat} user={username} />\n);\n}\n&#x3C;/ul>&#x3C;/code>\n</code></pre>\n<p>This is how I really render data with the map function. It will map each element in the array of chats to a Message Component where, this time, I do pass data as properties to this Message Component.</p>\n<pre><code>&#x3C;code class=\"language-javascript\">const Message = ({chat, user}) => (\n{/* SKIP: HTML codes /}\n{/ Check out details at https://github.com/WigoHunter/react-chatapp/blob/master/src/Message.js */}\n);&#x3C;/code>\n</code></pre>\n<p>And the functional declaration of this Message Component in <a href=\"https://github.com/WigoHunter/react-chatapp/blob/master/src/Message.js\">src/Message.js</a> is simpler. It doesn’t own JavaScript functions and simply renders HTML codes expecting two data inputs: chat and user to be used in the HTML codes.</p>\n<h3>Submit New Message</h3>\n<p><img src=\"https://cdn-images-1.medium.com/max/1600/1*Vxqxe9UPRmzL83ssCOvqKQ.png\" alt=\"submit a new message - eulercoder\">The bottom part that submits a new message</p>\n<p>Submitting in React is not much different from what you would do with pure JavaScript, or Vanilla JS if you prefer (xD). Just remember that you can get data from UI with the library ReactDOM that comes with create-react-app. So for example, we have an input like this in the bottom of the chatroom.</p>\n<pre><code>&#x3C;code class=\"language-markup\">&#x3C;input type=“text” ref=“msg” />&#x3C;/code>\n</code></pre>\n<p>We would be able to get its value by:</p>\n<pre><code>&#x3C;code class=\"language-markup\">ReactDOM.findDOMNode(this.refs.msg).value&#x3C;/code>\n</code></pre>\n<p>Therefore the texting part in the bottom would be like:</p>\n<pre><code>&#x3C;code class=\"language-markup\">&#x3C;form className=“input” onSubmit={(e) => this.submitMessage(e)}>\n&#x3C;input type=“text” ref=“msg” />\n&#x3C;input type=“submit” value=“Submit” />\n&#x3C;/form>&#x3C;/code>\n</code></pre>\n<p>And in the submitMessage function, (again, since we are using State to store the chat history in this case), we will use the native React function setState to modify the origin state of data and one more additional entry whenever users type and submit. For the sake of UX, let’s also reset the value of the input to an empty string on success.</p>\n<p>Another thing worth noting with React state is that it is immutable: so even if you want to insert an element into an array in states, you should use the JavaScript array method <strong>concat</strong> rather than <strong>push</strong>, which actually mutate the value of the state.</p>\n<h3>Finally, Deployment with Surge</h3>\n<p>So if everything goes right, you should have this Chatroom running just fine now. And the final part of deployment is where another great synergy of Create-react-app and <a href=\"https://surge.sh\">Surge</a> comes in handy.</p>\n<p>Now just trust me with this.</p>\n<p>Go to the root directory of this project in your terminal.</p>\n<pre><code>&#x3C;code class=\"language-git\">#If you don’t have surge yet then do this:\nnpm install -g surge&#x3C;/code>\n\n\n\n\n&#x3C;code class=\"language-git\">#If you already have surge, or after installing it:\nnpm start build\ncd build\nsurge&#x3C;/code>\n</code></pre>\n<p>There you go. Literally, three commands in Terminal and your first React site will be running healthy and at no cost at a <a href=\"https://Surge.sh\">Surge.sh</a> sub-domain just like my <a href=\"https://react-chatapp.surge.sh\">react-chatapp.surge.sh</a> with free and built-in SSL/HTTPS.</p>\n<h3>Whoa! My First Attempt</h3>\n<p>This is the first time I have ever made a blog post that is even close to being a tutorial.</p>\n<p>Now I think I did skip some of the codes in this post, primarily because I don’t believe copying all the codes and explain to them line by line is a good way to elaborate. So I took another approach and tried to reason the high-level designs and functions we have in this Chatroom Component, along with the introduction of some concepts and tools that synergy well with React.</p>\n<p>I would definitely appreciate if some of you can share some opinions in the comment section.</p>\n<p>But yeah, this is how I made this React Chatroom Component in 100 lines explained — Now I am more comfortable to say that at least I made some uses of these codes, and put it aside, for now, to prepare for my GRE test, graduate program applications and job searches!</p>\n<p>**Highly Recommended articles: **</p>\n<p>If you are looking for Summer Internship or preparing for full-time job, I highly recommend you to read out <a href=\"https://eulercoder.me/2017/07/summer-internship-ultimate-guide/\">Summer Internship: The Ultimate Guide</a>. We have also written a beginner's guide on <a href=\"https://eulercoder.me/2017/07/getting-started-open-source/\">Getting Started with Open Source Development</a>. Do read them!</p>\n<hr>\n<p>Anyways, if you are interested in talking to me, perhaps there is something in this tutorial I failed to explain enough, or even if you see potential synergies between you and me (just like create-react-app and surge), feel free to reach me at <a href=\"mailto:kevin@projectable.hk\">kevin@projectable.hk</a> or connect me on <a href=\"https://www.linkedin.com/in/kai-chun-kevin-hsu-5428bbb4\">Linkedin</a>.</p>\n<hr>\n<p>**Have something to talk about? Want to contribute in our <a href=\"https://eulercoder.me/about\">Mission and Goal</a>? Write on Eulercoder. Write an <a href=\"mailto:hello@eulercoder.com\">email to us</a> or <a href=\"https://eulercoder.me/contact\">contact us</a> for guest posts. **</p>\n<p>Did you found this article useful? Write your comments below. 🙂</p>\n<p>If you found this article useful, do share with your friends. Let’s help everyone in getting a better internship, job and help them in learning programming. Subscribe to our newsletter and get weekly curated content directly in your mail box. Also, we have our own group on FB, we take Q&#x26;A, post materials in the group. I’ll highly recommend you Like <a href=\"https://www.facebook.com/eulercoder\">our FB page</a> and <a href=\"https://www.facebook.com/groups/eulercoder\">join our FB Group.</a> for discussions and latest updates.</p>\n<hr>","frontmatter":{"title":"Let us Build a React Chatroom Component in 100 Lines of Code","categories":null,"date":"28 August, 2017","author":{"fields":{"slug":"/contributors/kevin"},"id":"Kevin"}}}},"pageContext":{"slug":"/2017/08/react-chatroom-100-lines","next":{"frontmatter":{"title":"Let us Build a React Chatroom Component in 100 Lines of Code","author":{"id":"Kevin"}},"fields":{"slug":"/2017/08/react-chatroom"}},"prev":{"frontmatter":{"title":"College and low GPA- Everything you need to know.","author":{"id":"vicky002"}},"fields":{"slug":"/2017/08/college-and-low-gpa"}}}}