{"data":{"markdownRemark":{"html":"<p>Nowadays I'm getting a lot of messages on Quora and Facebook about competitive programming. People ask me \"I'm yellow on Codeforces, I applied to many companies but no luck. I never got shortlisted for any company what should I do?\". Today I'm going to write my own 'personal thoughts' about competitive programming and development.</p>\n<p>Well, I realized competitive programming is not for me and I have totally stopped Competitive Programming. I do participate occasionally and I solve practice problems on different coding problems in free time to improve my Algo and DS concepts. Now I'm more involved in development I love <a href=\"https://github.com/vicky002\">open source</a>. I love the feeling of creating something for the community it gives me more pleasure than seeing those green tick marks.</p>\n<p>There is big hype of competitive programming in India. Students think that doing well in CP will give them the best jobs in big tech companies. Most of the students start CP without having any interest in it, they force themselves to participate in coding challenges to get good rankings so that they can mention it on their resume. They search for solutions on different online platforms which leads to cheating in coding competitions. Ask yourself at least once, do you really like competitive programming? Why are you doing CP? Just because few amazing people have got jobs in big companies like Google, Facebook and Microsoft through CP? <a href=\"https://www.quora.com/Will-Directi-hire-an-engineer-if-he-has-55-percent-considering-the-fact-that-he-is-a-very-good-programmer-and-has-solved-400-problems-on-SPOJ\">Will Directi hire an engineer if he has 55 percent, considering the fact that he is a very good programmer and has solved 400 problems on SPOJ?</a> There are many such questions are <a href=\"https://www.quora.com/pinned/Competitive-Programming\">Quora</a>.</p>\n<h2>Pros and Cons of competitive programming.</h2>\n<h3>Pro</h3>\n<ul>\n<li>\n<p>CP improves your logical and analytical skills.</p>\n</li>\n<li>\n<p>It improves your algorithmic knowledge.</p>\n</li>\n<li>\n<p>You can \"pass\" through interview of big tech companies because interviews are mostly algorithmic based and that's what you train for.</p>\n</li>\n<li>\n<p>You get free T-shirts in coding competitions and people give you respect.</p>\n</li>\n</ul>\n<!-- more -->\n<h3>Cons</h3>\n<ul>\n<li>\n<p>You get addicted to competitions. In real life when you work in a company with lots of responsibilities, you can quickly lose motivation, when there is no one to beat.</p>\n</li>\n<li>\n<p>You get used to small rewards and short-term goals. In real life when you work on a project it takes months before you get rewarded for the project you're working on.</p>\n</li>\n<li>\n<p>You know a programming language exceptionally well but you don't know any frameworks. It is more practical, time-consuming and more boring to learn and you need to do it a hell-lot more often!</p>\n</li>\n<li>\n<p>In CP you see WA, AC or TLE on a problem but in real life, it takes a huge effort in testing a software on different data sets, platforms, and devices. It takes months in testing and finalizing a software.</p>\n</li>\n<li>\n<p>Machine learning, Artificial Intelligence, Image processing and cryptography - you never used these in coding competitions. These are highly used branches of computer science in big companies.</p>\n</li>\n</ul>\n<h2>Vicky, Tell me what Software development really is?</h2>\n<blockquote>Software development is the process of computer programming, documenting, testing, and bug fixing involved in creating and maintaining applications and frameworks involved in a software release life cycle and resulting in a software product.</blockquote>\n<p>OR</p>\n<blockquote>Software development is the process of designing, building, testing and shipping a software that makes the world a better place.</blockquote>\n<p>If you're making something using your programming knowledge to makes anyone's life easier and simpler then you are a software developer.</p>\n<p>Here I'm referring to Open source development</p>\n<h3>What are Pros of Open source Development</h3>\n<ul>\n<li>\n<p><strong>Solving Problems</strong>: This gives you a sense of accomplishment, at the end of the day, you can look back and point at something that you did or made or finished and many people are using your software.</p>\n</li>\n<li>\n<p><strong>Learning</strong>: You work on a real life projects whether it's a simple android app, plugins, integrations, new frameworks or bot. You learn how to work on a real life project using different languages and frameworks following a software process. There are many awesome new technologies and framework available and people are coming up with new technologies and frameworks daily.</p>\n</li>\n<li>\n<p><strong>Open Source Community</strong>: Open source community is so huge and there are thousands of projects available on <a href=\"https://github.com\">Github</a> to contribute and work on. When you start working on open source projects you'll get to learn how do big organizations work and maintain large codebase, Git and SVN version control mechanism, you interact with software engineer and developer from all around the world.</p>\n</li>\n</ul>\n<h3>And what about cons?</h3>\n<ul>\n<li>It takes <strong>lot of time and effort</strong> but trust me that feeling of creating a software or application is amazing! Recently my friend create a bot for Slack which integrate with <a href=\"https://moodle.org\">Moodle</a> to show all your upcoming submissions. He was telling me about how he spent last ten days working on this and how it feels after finalizing the product.</li>\n</ul>\n<h2>Can only competitive programming get you placed or get you a good <a href=\"https://eulercoder.me/2017/07/slack-internship-sf-silicon-valley/\">internship</a>?</h2>\n<p><strong>Absolutely Not!!</strong> (Assuming that you don't any contacts in top companies, those who can refer you for the interviews!)</p>\n<p>The toughest part in getting a job is to get shortlisted for the interviews. Big tech companies receive thousands of resume for one single position. You can get noticed by recruiters only by doing CP if you perform exceptionally well (ACM-ICPC WFs, Regional winners, CodeJam and FB HackerCup top 50s), but still, have to go through those 5-6 rounds of interviews and it depends on lots of other factors too.</p>\n<h2>So Vicky, What do I need to do to get shortlisted for the interviews?</h2>\n<ul>\n<li>\n<p>A very good resume so that you get shortlisted for the interviews.</p>\n<ul>\n<li>\n<p>A very resume can be built by doing some awesome projects.</p>\n</li>\n<li>\n<p>Some awesome projects requires knowledge of new generation languages like python, Go, Dart, JS, php etc and other frameworks.</p>\n</li>\n</ul>\n</li>\n</ul>\n<pre><code>  * To learn these languages you have to give time and best way to learn something is by doing.\n\n\n* Once you get shortlisted then you also need to have good knowledge of algorithms and data structures.\n\n\n* To learn Algo and DS you need to read and practice on website like [Geeksforgeeks](https://www.geeksforgeeks.org), [CodeChef](https://codechef.com), [TopCoder](https://www.topcoder.com), [LeetCode](https://leetcode.com), [CareerCup](https://www.careercup.com).\n\n\n* You also need a medium level communication skills.\n</code></pre>\n<h2>Conclusion</h2>\n<p>In conclusion, I think both are very good for personal development. Through Competitive programming, you will be well versed with data structures and algorithms and this will surely help you in cracking job interviews. If you choose Open Source and if you pick the right project, you'll learn to write better, cleaner code (not necessarily faster), that's broadly acceptable. You'll learn to organize and document your code better, which is a critical skill. You'll gain meaningful experience on your resume, which will lead to more interviews at good companies, whatever your experience or education level is. I'd suggest you try both if you're doing only CP aim for ACM-ICPC, CodeJam, and HackersCup and keep doing if you really love it.</p>\n<p>Anudeep Nekkanti describes CP perfectly:</p>\n<blockquote>“I see that a lot of Indians are putting a lot of effort into competitive programming (mainly for placement offers) with not so good results. Trust me, do it with complete concentration for a month, by then you will exactly know if you have to continue in this field or not. If you feel you should not continue, stop it, do not hang on to it hoping for offers. Use your time on other stuff.“</blockquote>\n<p>Don't forget to share this post with your friends. Let's help everyone in figuring out what, which one is for them. Also, if anything is not clear and you want more in-depth information about something, please join our community - <a href=\"https://www.facebook.com/groups/eulercoder/\">Computer Science students group </a>on Fb. There will be open discussion everyday at 9 PM and there are many other people to help and guide.</p>\n<p>Thank you!</p>","frontmatter":{"title":"Competitive Programming and Open Source- Which one to choose","categories":["discussion","open-source"],"date":"23 July, 2017","author":{"fields":{"slug":"/contributors/vicky002"},"id":"vicky002"}}}},"pageContext":{"slug":"/2017/07/competitive-programming-and-open-source","next":{"frontmatter":{"title":"HTTP Headers Related to Security","author":{"id":"vicky002"}},"fields":{"slug":"/2017/07/http-headers"}},"prev":{"frontmatter":{"title":"Slack Bot using Wolframalpha API - Basic Guide","author":{"id":"vicky002"}},"fields":{"slug":"/2017/07/slack-bot"}}}}