{"data":{"markdownRemark":{"html":"<p>Just another weekend to C&#x26;C (Chill &#x26; Code) in Taiwan</p>\n<pre><code>&#x3C;meta http-equiv=\"refresh\" content=\"0; url=https://www.eulercoder.com/2017/09/02/chatweb%e2%80%8a-%e2%80%8abuild-websites-that-understand-users-with-full-free-microsoft-stack/\">\n&#x3C;link rel=\"canonical\" href=\"https://www.eulercoder.com/2017/09/02/chatweb%e2%80%8a-%e2%80%8abuild-websites-that-understand-users-with-full-free-microsoft-stack/\" />\n</code></pre>\n<h3>ChatWeb?</h3>\n<p>Chatbot has been a hot topic around for sure. I still remember how 4 teams out of the 12 teams in <a href=\"https://ecjamming.tech\">E.C. Jamming</a>, a Hackathon I organized with Microsoft a couple of months ago in Hong Kong, were working on chatbot projects.</p>\n<!-- more -->\n<p>But I am a real web lover and evangelist.</p>\n<p>There are great frameworks out there like Google <a href=\"https://api.ai\">API.ai</a>, <a href=\"https://dev.botframework.com/\">Microsoft Bot Framework</a> and <a href=\"https://www.luis.ai\">Microsoft LUIS</a> (Language Understanding Intelligence Service) that enable developers to build and launch chatbots in multiple channels with not much an effort.</p>\n<p>In other words, to empower chatbot developers, the tech giants have invested a considerable amount of resources to build up the components and micro-/web-services that can perform a single specific task in a chatbot’s pipeline both efficiently and accurately. For example, LUIS helps you understand a user with training models backed by Machine Learning with a single API endpoint.</p>\n<p>Now, why don’t we <strong>take these services to build a website that understands users’ intentions and interests just like a chatbot</strong>, and at the same time, with the rich elements the web has to offer, we are able to provide more interactions than a traditional chatbot.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/1600/1*FMBO66chD18WVdITPk_5VQ.png\" alt=\"background prototype - chatweb Microsoft stack eulercoder\"> The background of prototype was from <a href=\"https://tympanus.net/codrops/2014/09/23/animated-background-headers/%5B/caption\">https://tympanus.net/codrops/2014/09/23/animated-background-headers/[/caption</a>]</p>\n<p>In my case, I am now building a personal portfolio page for the applications for graduate programs in the US.</p>\n<p>On top of the static, standard resume-alike HTML contents, I am implementing a header that interacts with users and rearranges the styles and components rendered on the page once users ask a specific question regarding my experiences — Just as if I was there, 1 on 1, with this user to answer questions like “What have you been working on at Microsoft?”.</p>\n<h4>Read: <a href=\"https://eulercoder.me/2017/07/create-slack-bot-using-wolframalpha-api/\">Build your first Slack Bot using WolframAlpha API in Python</a></h4>\n<p>What’s even better is this tutorial and the so-called ChatWeb is built with a server-less architecture (thanks to <a href=\"https://azure.microsoft.com/en-us/services/functions/\">Azure Functions</a>), which means you won’t have to worry about building and maintaining a server at all. Just front-end. Just <strong>ReactJS</strong>.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/1600/1*JdAeqbbDO3LCP-29FbAPZg.png\"></p>\n<p>Everything below assumes a working Azure account. Azure provides free trial for a month for you to play around. Even after the free trial expires, all the products in this architecture have monthly free quotas that are not easily exceeded.</p>\n<hr>\n<h3>Contents</h3>\n<ul>\n<li>\n<p>Training and Publishing a Microsoft LUIS endpoint</p>\n</li>\n<li>\n<p>Build Azure Functions</p>\n</li>\n<li>\n<p>React and Fetch</p>\n</li>\n</ul>\n<hr>\n<p><img src=\"https://cdn-images-1.medium.com/max/2000/1*-ZOlRRQFUcOWumuAqUVBPg.png\"></p>\n<h3>Microsoft LUIS</h3>\n<p>So again. LUIS plays a significant role in the chatbot’s ecosystem by empowering bots to understand the literal from users. The end goal of a LUIS endpoint is by consuming a query, it returns a JSON data with the answers to questions like “What does the user want?” and “Any specific entities involved?”</p>\n<pre><code>&#x3C;code class=\"language-javascript\">Example:\nquery = \"What have you done at Microsoft?&#x3C;/code>\n\n\n\n\n&#x3C;code class=\"language-javascript\">-----&#x3C;/code>\n\n\n\n\n&#x3C;code class=\"language-json\">LUIS API returns\n{\n“query”: “what have you done at microsoft”,&#x3C;/code>\n\n\n\n\n&#x3C;code class=\"language-json\">“topScoringIntent”: {\n“intent”: “WhatDidYouDo”,\n“score”: 0.729854763\n},&#x3C;/code>\n\n\n\n\n&#x3C;code class=\"language-json\">“entities”: [ {\n“entity”: “microsoft”,\n“type”: “Company”,\n“startIndex”: 22,\n“endIndex”: 30,\n“score”: 0.9897579\n} ]\n}&#x3C;/code>\n</code></pre>\n<p>With this information and the functional component rendering mechanism in React JS, you are already ready to build your LUIS web app.</p>\n<p>But before we dive into just that, and how we can protect our subscription key with Azure Functions, let me also show you how I trained my language understanding models on <a href=\"https://www.luis.ai\"><strong>LUIS.ai</strong></a>.</p>\n<h4>Step-By-Step Guide to Build a LUIS App</h4>\n<p><img src=\"https://cdn-images-1.medium.com/max/1600/1*cnVWjxUFHP_E78--heNZqw.png\"></p>\n<p>After creating an account on LUIS, you should be led to this page.</p>\n<p>Click the button New App. It should ask you about the name of your app and its culture (en-us, for example. I haven’t tried with other cultures.).</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/1600/1*o-Zd3zuwEVg7hpo5KOYf5A.png\">LUIS Dashboard</p>\n<p>On the sidebar, click Intent where you will start to define the possible intents your users might possess. For example, if you are making an e-commerce website, the possible intents the website should observe can be “Purchase”, “Browse”, “Customer Support”, etc. Basically, try to list out all the possible reasons for a user to come and use your app.</p>\n<blockquote>In my case of building a portfolio page, I want my LUIS app to help me detect from a sentence if a user is more interested in what did I learn (the technology stacks), or what did I do (the project details), and at which company, so I can deliver a suitable and personalized layout.</blockquote>\n<p><img src=\"https://cdn-images-1.medium.com/max/1600/1*MoMqIagOd6uKOqdyNHXQew.png\"></p>\n<p>After an intent is created, you can give LUIS some examples where this specific intent should be expected. For this example, I told LUIS a user who asks questions like “What did you do for Microsoft”, “What have you been doing in Microsoft”, etc, are likely to hold the intent of asking “What Did You Do” (Intent) with “Microsoft” being mapped to the company entity.</p>\n<p>After you input a solid 10 examples per intents defined, go to <strong>Train &#x26; Test</strong> on the sidebar and click “<strong>Train Application</strong>”. LUIS will handle the machine learning part for you.</p>\n<p><strong>Magic.</strong></p>\n<p>I love being an application developer in the early 21st century; fresh and cool, but not yet completely taken over by AI.</p>\n<p>Once it is done, go to “<strong>Publish App</strong>” page and you can straight up just one-click push the app to production and get an endpoint that looks like this:</p>\n<pre><code>&#x3C;code class=\"language-https\">https://westus.api.cognitive.microsoft.com/luis/v2.0/apps/{app id}?subscription-key={app key}&#x26;timezoneOffset=0&#x26;verbose=true&#x26;q={user query}&#x3C;/code>\n</code></pre>\n<p>And bang.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/1600/1*h5xztCIsevgeFnH15T4Uug.png\"></p>\n<p>You now have an endpoint that translates a user’s literal inputs, into structured and self-defined intents and entities in JSON format.</p>\n<h3>Azure Functions</h3>\n<p>Now, this step is not compulsory but highly recommended, for the reason that it is generally a bad practice to expose your secrets and keys to client browsers.</p>\n<p>Especially LUIS starts to charge you once the amount of your monthly request exceeds 10K — This is not that ambitious as you think. Request means transactions. A happy user who is just too excited to stop asking questions for fun can be one heavy load.</p>\n<p>You really don’t want to take the risk to let other people use your subscription keys on their LUIS app — You might not be aware of the usage on other sites, but their bills would be on you.</p>\n<p>We could solve this problem by implementing a proxy server, perhaps with Node and Express, and have the HTTP requests done on the backend.</p>\n<p>But, <strong>Azure Function is another better solution, if not the best.</strong></p>\n<p>And it is very simple.</p>\n<p>Let’s see how we can build a proxy endpoint with Azure Functions <strong>in 5 min</strong>.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/1600/1*CpRBltKvIAuA47b-4fycjw.png\"></p>\n<p>Just search “Function App” on Azure Dashboard and create one with an App name (I named mine “LUIS-proxy”), subscription plan (Yep… My Internship at Microsoft ends. Free Trial time.) and all other simple and expected inputs. Nothing should surprise you here.</p>\n<p>[caption id=\"\" align=\"alignnone\" width=\"1600\"]<img src=\"https://cdn-images-1.medium.com/max/1600/1*sJ-Rik66EL4JTkluFb1Abg.png\" alt=\"chatweb microsoft web - eulercoder\"> Click the + next to “Functions” on sidebar to create a Function App[/caption]</p>\n<p>So what this Function App is going to do, is that it is going to act just like the LUIS endpoint we got from the previous steps, but without giving users the access to your API IDs and Subscription Keys.</p>\n<p>Let me just quote this from the official site of Azure Functions — Who can possibly explain Azure Functions other than the team themselves.</p>\n<blockquote>“Functions provides a fully managed compute platform with high reliability and security. With scale on demand, you get the resources you need — when you need them.”</blockquote>\n<p>With Azure Functions, the client-side code will be calling this Azure endpoint where it will then complete the HTTP request using API key of LUIS on Azure’s computing platform and simply return the LUIS result to the client side. Think of this like a lambda function on the Azure cloud, if you are familiar with Functional Programming.</p>\n<p>Again, if you are not familiar with this, this step is not a must to achieve a website that understands users. This is for security reason. And also, you are welcome to build this proxy with Node and Express stack and setup the API endpoint with <a href=\"https://eulercoder.me/recommends/digitalocean/\">Digital Ocean</a>, <a href=\"https://www.linode.com/\">Linode</a> or <a href=\"https://www.heroku.com/\">Heroku</a>. They are all nice and neat in this case.</p>\n<p>But if you decided to follow me on this,</p>\n<p>Here is what you will do on your Function App:</p>\n<p>[caption id=\"\" align=\"alignnone\" width=\"2000\"]<img src=\"https://cdn-images-1.medium.com/max/2000/1*E193G13sLrhjOHUDJv3Vzw.png\" alt=\"chat web - Microsoft stack - eulercoder\"> functions[/caption]</p>\n<p>This function is written in C#, primarily because I felt like C# can finish the task (simply download the responding resource from LUIS) in a more efficient manner with. <code>WebClient</code> Azure Functions do support JavaScript, feel free to do this part the way you are comfortable with.</p>\n<p>But you can really use this code I wrote to shield any API keys you have from any web-service providers. Just paste the Url link you would use in AJAX into the placeholder I had on this screenshot, and click the <strong>&#x3C;/> Get function URL</strong> on the top right corner to get the proxy endpoint for LUIS in this case.</p>\n<p>Finally, under {Your App} > CORS, remember to define and manage a list of white-list origins to call this endpoint. I really love this feature. This ensures <strong>only your websites have the permission to consume these API endpoints</strong>.</p>\n<h3>React and Fetch</h3>\n<p>Finally, for the client side code, I am choosing to React once again.</p>\n<p>But this time, there are reasons besides “React is cool and clean”. I promise.</p>\n<p>React has the ability to control the components rendered with,<code>this.state</code> we don’t have to do AJAX request so frequently into a callback hell. And the polyfill Fetch library that returns a ES6 Promise works seamlessly with React.</p>\n<p>Before I start showing some codes. Remember to run the create-react-app.</p>\n<pre><code>&#x3C;code class=\"language-git\"># in your terminal\ncreate-react-app &#x3C;project name>\ncd &#x3C;project name>\nnpm install --save whatwg-fetch\nnpm start&#x3C;/code>\n</code></pre>\n<p>This should set you up with everything you will need and also open up the app at localhost:3000.</p>\n<p>With fetch and React’s <code>state</code> available right now, we will be able to let the app render components based on users intent returned from LUIS. My high-level architecture will be something like this (a constructor, a function that handles LUIS query, and a render function)</p>\n<pre><code>&#x3C;code class=\"language-javascript\">… standard React import statements\nimport ‘whatwg-fetch’;&#x3C;/code>\n\n\n\n\n&#x3C;code class=\"language-javascript\">class ChatWeb extends Component {\nconstructor(props) {\nsuper(props);\nthis.state = {\nquery: “”,\nintent: “”,\ncompany: “”\n}\n}&#x3C;/code>\n\n\n\n\n&#x3C;code class=\"language-javascript\">submitLUISQuery(e) {\ne.preventDefault();&#x3C;/code>\n\n\n\n\n&#x3C;code class=\"language-javascript\">fetch ({Azure Functions Endpoint}&#x26;query=${this.state.query})\n.then(res => JSON.parse(res.json()))\n.then(json => {\nthis.setState({\nintent: json.topScoringIntent.intent,\ncompany: json.entities[0].entity\n});\n});\n}&#x3C;/code>\n\n\n\n\n&#x3C;code class=\"language-javascript\">&#x3C;/code>\n\n\n\n\n&#x3C;code class=\"language-javascript\">render() {\nconst { intent, company } = this.state;&#x3C;/code>\n\n\n\n\n&#x3C;code class=\"language-javascript\">return ( { intent === “WhatDidYouDo” &#x26;&#x26; &#x3C;TheComponentForThisCase company={company} /> } { intent === “WhatDidYouLearn” &#x26;&#x26; &#x3C;TheComponentForThisCase company={company} /> } ); } }&#x3C;/code>\n</code></pre>\n<p>Now I think the control of rendering can certainly be cleaner with <code>react-router-dom</code>. And my job on this portfolio project, from now on, will be exactly on this — To find a more efficient and modularized way to properly pipeline the technology stacks and data.</p>\n<p>Again, this is a concept and high-level prototype that I just can’t wait to share with the community. Especially the new (and last) semester starts this week, and I will be stuck in applications of graduate programs, GRE, and potential job searches (Yes. I am still hoping to have employers sponsoring my visa, so I don’t need OPT that desperately.)</p>\n<p>[caption id=\"attachment_864\" align=\"aligncenter\" width=\"728\"]<img src=\"https://eulercoder.me/wp-content/uploads/2017/09/two-year-of-selflearning-in-article-post.jpg\">](<a href=\"https://eulercoder.me/2017/08/2-years-of-self-learning-into-a-developer/\">https://eulercoder.me/2017/08/2-years-of-self-learning-into-a-developer/</a>) Two years of Self-Learning into a developer[/caption]</p>\n<h3>Finally…</h3>\n<p>I just want to say that, of course, this is not an optimal user experience as of the moment. People do not (yet) expect to talk to your websites, which is also the reason these technologies have been used on Chatbot primarily. But I think this is definitely a fun and interesting experiment that I would dive farther— <strong>We can definitely make websites understand users just like chatbots</strong>.</p>\n<p>This is really exciting for me!</p>\n<p><strong>This opens a lot of new possibility of web UX.</strong></p>\n<p>If you do have any better UX design that can synergy with this ChatWeb concept, definitely reach me out at <a href=\"mailto:kevin@projectable.hk\">kevin@projectable.hk</a>, connect me on <a href=\"https://www.linkedin.com/in/kai-chun-kevin-hsu-5428bbb4\">LinkedIn</a>, or simply leave comments below. WE have jobs to do!</p>\n<hr>\n<p>**Have something to talk about? Want to contribute to our <a href=\"https://eulercoder.me/about\">Mission and Goal</a>? Write on Eulercoder. Write an <a href=\"mailto:hello@eulercoder.com\">email to us</a> or <a href=\"https://eulercoder.me/contact\">contact us</a> for guest posts. **</p>\n<p>Did you found this article useful? Have questions? Write your comments below. 🙂</p>","frontmatter":{"title":"ChatWeb  -  Build websites that understand users with full (free) Microsoft Stack","categories":["learning","tutorials"],"date":"02 September, 2017","author":{"fields":{"slug":"/contributors/kevin"},"id":"Kevin"}}}},"pageContext":{"slug":"/2017/09/build-chatweb-using-microsoft-stack","next":{"frontmatter":{"title":"Eulercoder Project Series Fabulous Bot First Project Announcement","author":{"id":"vicky002"}},"fields":{"slug":"/2017/09/eulercoder-project-series-fabulous-bot"}},"prev":{"frontmatter":{"title":"LinkedIn tips that actually work- Set up your News Feed on LinkedIn","author":{"id":"Nicholas"}},"fields":{"slug":"/2017/08/linkedin-tips"}}}}