{"data":{"markdownRemark":{"html":"<p>You will be preparing for the interviews but you need to have some basic knowledge of computer science before beginning the preparation phase. In the last previous article, we discussed what is the ideal time to apply for internships and in this article, we are going to discuss what basic skills needed prior to applying for internships and starting the interview preparation.</p>\n<h3>Basic skills needed prior to internship application process</h3>\n<p>Most of the students ask me, I am looking for an internship in the second year only, please suggest me what I should learn before applying. So, here is the list of things you should be knowing before you begin the application process.</p>\n<h4>1. Programming Language</h4>\n<p>You should be good in one programming language. The interviewer will ask you to write code on a whiteboard or on a shared screen for a given problem. Generally, the interview looks for</p>\n<ul>\n<li>\n<p>Whether the code is readable or not</p>\n</li>\n<li>\n<p>How well you choose functions available in that programming languages</p>\n</li>\n<li>\n<p>How you name variables</p>\n</li>\n<li>\n<p>Whether you are commenting your code or not</p>\n</li>\n<li>\n<p>Your coding style</p>\n</li>\n</ul>\n<p>I would suggest Java, C++, Python, and Javascript language. It doesn't really matter which programming language you choose to write code in the interview. Just, learn and practice programming problems in the language of your choice. Crash courses on different programming languages will be available on Eulercoder very soon, I'll highly recommend subscribing to our latest course updates.</p>\n<h4>2. Algorithms and Data Structures</h4>\n<!-- more -->\n<p>After the programming language, this is the most important part of any interview. Even though you will be preparing and revising algorithms and data structures in the preparation phase, you need some basic knowledge.</p>\n<ul>\n<li>\n<p>Know what is complexity and Big O notations</p>\n</li>\n<li>\n<p>Clear your basics of Array, LinkedList, Stack, and Queue</p>\n</li>\n<li>\n<p>Understand and implement different sorting algorithms</p>\n</li>\n<li>\n<p>Understand and implement searching, graph, and tree algorithms etc.</p>\n</li>\n</ul>\n<p>The interviewer will give you a problem and ask you to code. Just coming up with an appropriate answer is not sufficient, the interviewer will ask you to optimize your code, think of different corner cases and give a solid approach to the problem. This is where Data structures and algorithms are important. You need to know different possible scenarios where an algorithm can be applied or an appropriate data structure can be used. Most common data structures and algorithms will be available on Eulercoder very soon.</p>\n<h4>3. CS Related fundamentals</h4>\n<p>Apart from programming knowledge and Algorithms, companies also ask questions on basic CS fundamentals. These are generally theoretical questions but very useful in your internship.</p>\n<ul>\n<li>\n<p>Know basics of Networking</p>\n</li>\n<li>\n<p>Basics of Linux Commands</p>\n</li>\n<li>\n<p>Database (MySQL or MongoDB) etc</p>\n</li>\n</ul>\n<h4>4. Good Communication Skills</h4>\n<p>This is also very important. You will be working in a team, you will have to communicate with team members and explain work, projects and your solution. Previously I used to struggle while explaining my solutions, this happens with most of us. So, you need to practice, explains things to your friends, work on creating a good flow of your solution, use examples, speak closely and, in the interview keep your interviewer involved, being quite and coding doesn't work.</p>\n<h4>5. Projects</h4>\n<p>You need to have projects in your resume before you start the application process. The resume should contain projects related to CS, if you are not from CS background, you can still work and find projects on Github. Do independent projects or work on open source projects. If you can't think of any project ideas, I have created <a href=\"https://github.com/vicky002/1000_Projects\">1000 Projects repository, which contains over 500+ projects</a> right now. Don't create projects just to show and fill your resume, create something useful. School Management system, Library management system, all such projects are already available on the web. Unless, something you have built something unique, it won't contribute in your resume.</p>\n<p>So, this was all about the basic skills you need prior to applying for internships.</p>\n<p>If you found this article useful, do share with your friends. Let's help everyone in getting a better internship and job. Subscribe to our newsletter and get weekly curated content directly in your mail box. Also, we have our own group on FB, we take Q&#x26;A, post materials in the group. I'll highly recommend you to <a href=\"https://www.facebook.com/groups/eulercoder\">join our FB Group.</a></p>\n<p><strong>Recommended Articles:</strong></p>\n<ul>\n<li>\n<p><a href=\"https://eulercoder.me/2017/07/slack-amazon-mozilla-linkedin-interview/\">Slack, Amazon, LinkedIn, Browserstack and Mozilla - My internship interview experience</a></p>\n</li>\n<li>\n<p><a href=\"https://eulercoder.me/2017/07/slack-internship-sf-silicon-valley/\">Slack, San Francisco and Silicon Valley - My Summer 2016</a></p>\n</li>\n</ul>","frontmatter":{"title":"Basic skills needed prior to applying for internships","categories":["internship"],"date":"30 July, 2017","author":{"fields":{"slug":"/contributors/vicky002"},"id":"vicky002"}}}},"pageContext":{"slug":"/2017/07/skills-needed-for-internship","next":{"frontmatter":{"title":"Twitter Internship and Undergrad Role 2018- Everything you need to know","author":{"id":"vicky002"}},"fields":{"slug":"/2017/08/twitter-internship"}},"prev":{"frontmatter":{"title":"Three Internships mandatory for Engineering Students- Analysis and Discussion","author":{"id":"vicky002"}},"fields":{"slug":"/2017/07/three-internship-mandatory"}}}}