{"data":{"markdownRemark":{"html":"<p>Many students ask us questions related to college and low GPA. Students with low GPA or those who are in tier three colleges, hesitate in applying for jobs or internships. In this article, we will be discussing and analyzing everything related to college and GPA, its benefits and importance. Also, we will be discussing, whether having a low GPA affect your chances of getting an internship or a job. So let's get started!</p>\n<h1>College and GPA: Benefits and importance</h1>\n<ul>\n<li>\n<p>As companies get tons of resumes for every single job/internship, GPA is **just a criteria **for them to shortlist candidates.</p>\n</li>\n<li>\n<p>It is impossible for companies to interview every single candidate, so companies use GPA as a yardstick to shortlist profiles.</p>\n</li>\n<li>\n<p>It is generally seen that students from top colleges get higher preference over students from tier two or three.</p>\n</li>\n<li>\n<p>If someone is studying in MIT or Standford then definitely he/she will get higher preference over someone who is studying in Mumbai University in India.</p>\n</li>\n<li>\n<p>Reputed colleges and higher GPA shows that student has worked hard to get into a college and he was very punctual in college.</p>\n</li>\n</ul>\n<!-- more -->\n<p>[clickToTweet tweet=\"Your GPA is NOT going to feed you. What will do that is you practical skills.\" quote=\"your GPA is NOT going to feed you. What will do that is you practical skills. \"]</p>\n<h3>Few things to remember if you have low GPA</h3>\n<ul>\n<li>\n<p>GPA will only help you through campus placement that is during your first job only. Once you get your first job, no one will ask your GPA ever again.</p>\n</li>\n<li>\n<p>What matters at the end is your experience, your practical skills.</p>\n</li>\n<li>\n<p>If you have low GPA but you have many co-curricular achievements and good projects, you can easily get shortlisted for any company. In this case, both have equal chances of getting shortlisted.</p>\n</li>\n<li>\n<p>I had 2.2/5 GPA, I got the internship at Slack and then full-time offer.** Read:** <a href=\"https://eulercoder.me/2017/07/slack-amazon-mozilla-linkedin-interview/\">My interview experience with Slack, Mozilla, BrowserStack, LinkedIn, and Amazon</a></p>\n</li>\n<li>\n<p>Smart people can always get a good career - higher GPA not.</p>\n</li>\n</ul>\n<p>[clickToTweet tweet=\"Remember A 2.0 student can know more than a 4.0 student. Grades don't determine intelligence, they test obedience. \" quote=\"Remember A 2.0 student can know more than a 4.0 student. Grades don't determine intelligence, they test obedience. \"]</p>\n<h4>Complete Python Bootcamp: Go from zero to hero in Python</h4>\n<h5>We have partnered with Udemy for discount and offers on different courses. Get upto 92% off on the Ultimate Course on Python using our Links.</h5>\n<pre><code>[\n\n\n        Enroll Now!\n](https://click.linksynergy.com/deeplink?id=WQz2hZgW0To&#x26;mid=39197&#x26;u1=eulercoder&#x26;murl=https%3A%2F%2Fwww.udemy.com%2Fcomplete-python-bootcamp%2F)\n</code></pre>\n<h2>Final tips to get an Engineering job and internships with low GPA</h2>\n<ul>\n<li>\n<p>**Don't Mention your GPA: **If you have low GPA, leave it off. Do not mention your GPA in your resume. The hiring manager knows missing GPA means low GPA but leave it off anyway.</p>\n</li>\n<li>\n<p>**Demonstrate Practical Knowledge: **Having great projects on your resume, contribution to Open Source Projects, a solid Github profile (See my Github), relative internships, good co-curricular activities, competitive programming, hackathons etc. All these things are extremely important to get shortlisted and by having these things on your resume will definitely make you ahead of the competition. As we all know that Practical knowledge matters the most. Many students are great in schools/universities but can not translate the same in their practical outputs.<br>\n[clickToTweet tweet=\"Knowledge and Experience will always trump superficial GPAs. \" quote=\"Knowledge and Experience will always trump superficial GPAs. \"]</p>\n</li>\n<li>\n<p>**Apply to small companies/Startups first: **All the big companies receive tons of resumes and they use specific tools and algorithms to filter out candidates based on keywords. Recruiting team in big MNCs don't have time to go through every single resume so it's better to apply to small companies and startups first. They get fewer applications compared to MNCs and you will have higher chances of getting noticed.</p>\n</li>\n<li>\n<p>**Focus on Resume format: **Make sure your resume is free from grammar, spelling and formatting errors. **Use bullet points **and **highlight experience and achievements. **We highly recommend you to read our <a href=\"https://eulercoder.me/2017/07/summer-internship-ultimate-guide/\">Summer Internship: The Ultimate Guide</a> for best resume tips. You can also use my resume format mention in the guide.</p>\n</li>\n<li>\n<p>**Network: **Networking is extremely important in getting a good job. You have lower GPA, you may need referrals, the recruiter needs to know your skills and strength. Attend different on-campus placements sessions, go out of your way to talk to recruiters. When you and talk to engineers/recruiter, you create and control the very first impression - not your resume (your GPA).</p>\n</li>\n</ul>\n<p>Talk to people on LinkedIn groups, connect with people on the internet (Facebook), show them your work, ask for help. Start a conversation, build a rapport with them, ask for a referral before applying to a job in their company.</p>\n<h3>Lastly, Don't give up.</h3>\n<p>Persistence and patience pay off. I was rejected from 12 companies straight before getting shortlisted for 8 companies. You need to keep improving your skills and your resume. Once you have gotten your first engineering job, all future job and promotions will be based on your work experience. The only time your GPA will come up again is if you are applying to your graduate job. (Not happening ever again :p)</p>\n<hr>\n<p>What do you think about college and low GPA? Does it really matter? Have you secured a job/internship without mentioning your GPA on the resume? Share your experiences below in comments.</p>\n<p>**Have something to talk about? Want to contribute in our <a href=\"https://eulercoder.me/about\">Mission and Goal</a>? Write on Eulercoder. Write an <a href=\"mailto:hello@eulercoder.com\">email to us</a> or <a href=\"https://eulercoder.me/contact\">contact us</a> for guest posts. **</p>\n<p>Did you found this article useful? Write your comments below. 🙂</p>","frontmatter":{"title":"College and low GPA- Everything you need to know.","categories":["discussion","internship"],"date":"11 August, 2017","author":{"fields":{"slug":"/contributors/vicky002"},"id":"vicky002"}}}},"pageContext":{"slug":"/2017/08/college-and-low-gpa","next":{"frontmatter":{"title":"Let us Build a React Chatroom Component in 100 Lines of Code","author":{"id":"Kevin"}},"fields":{"slug":"/2017/08/react-chatroom-100-lines"}},"prev":{"frontmatter":{"title":"2 Years of Self-Learning Into a Developer- Eulercoder Motivation","author":{"id":"Kevin"}},"fields":{"slug":"/2017/08/self-learning"}}}}